app/controllers/document_controller.rb

  def index
    @document_templates = DocumentTemplate.all
---
SELECT `document_templates`.* FROM `document_templates` LIMIT 1