app/controllers/document_templates_controller.rb

SELECT `document_templates`.* FROM `document_templates`
---
  def index
    @document_templates = DocumentTemplate.all

SELECT `document_templates`.* FROM `document_templates` WHERE `document_templates`.`id` = ? LIMIT 1  [["id", "8"]]
---
  def show
    @document_template = DocumentTemplate.find(params[:id])

SELECT `placeholders`.* FROM `placeholders`
---
  def new
    @document_template = DocumentTemplate.new
    @placeholder_details=Placeholder.all

SELECT `placeholders`.* FROM `placeholders`
SELECT `document_templates`.* FROM `document_templates` WHERE `document_templates`.`id` = ? LIMIT 1  [["id", "7"]]
---
  def edit
     @placeholder_details=Placeholder.all
    @document_template = DocumentTemplate.find(params[:id])

INSERT INTO `document_templates` (`body`, `created_at`, `title`, `updated_at`) VALUES (?, ?, ?, ?)  [["body", nil], ["created_at", Thu, 02 Aug 2012 07:37:44 UTC +00:00], ["title", nil], ["updated_at", Thu, 02 Aug 2012 07:37:44 UTC +00:00]]
---
  def create
    @document_template = DocumentTemplate.new(params[:document_template])

    respond_to do |format|
      if @document_template.save

SELECT `document_templates`.* FROM `document_templates` WHERE `document_templates`.`id` = ? LIMIT 1  [["id", "1"]]
UPDATE `document_templates` SET `body` = '\nHi this is a sample template', `updated_at` = '2012-08-14 06:14:15' WHERE `document_templates`.`id` = 1
---
  def update
    @document_template = DocumentTemplate.find(params[:id])

    respond_to do |format|
      if @document_template.update_attributes(params[:document_template])

SELECT `document_templates`.* FROM `document_templates` WHERE `document_templates`.`id` = ? LIMIT 1  [["id", "9"]]
DELETE FROM `document_templates` WHERE `document_templates`.`id` = ?  [["id", 9]]
---
  def destroy
    @document_template = DocumentTemplate.find(params[:id])
    @document_template.destroy